app/controllers/users_controller.rb

UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "231891738.32ab004.d3d875a406ec4ad8ae6e2087bd3d50a2"], ["updated_at", "2015-06-08 01:33:48.259972"], ["id", 1]]
---
  def callback
    user = guest_user
    response = Instagram.get_access_token(params["code"], :redirect_uri => ENV['redirect_uri'])
    user.update(token: response.access_token)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "photo_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["photo_count", 146], ["updated_at", "2015-06-08 03:35:20.912770"], ["id", 2]]
---
  def crush
    user = User.find(session[:guest_user_id])
    access_token = user.token
    authorized_user = GetUserInfo.new(access_token)
    user.update(likes: authorized_user.get_all_likes)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if session[:guest_user_id]
      user = User.find(session[:guest_user_id])